mos-skw/stm32-git/text-2/Hardware/Encoder.c
#include "stm32f10x.h"                  // Device header

int16_t Encoder_Count;

void Encoder_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOA,GPIO_PinSource6);
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOA,GPIO_PinSource7);
	
	EXTI_InitTypeDef EXTI_InitStructure;
	EXTI_InitStructure.EXTI_Line = EXTI_Line0 | EXTI_Line1;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_Init(&EXTI_InitStructure);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitSTructure;
	NVIC_InitSTructure.NVIC_IRQChannel = EXTI0_IRQn;
	NVIC_InitSTructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitSTructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitSTructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitSTructure);

	NVIC_InitSTructure.NVIC_IRQChannel = EXTI1_IRQn;
	NVIC_InitSTructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitSTructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitSTructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_Init(&NVIC_InitSTructure);

}

void EXTI0_IRQHandler(void)
{
	if (EXTI_GetITStatus(EXTI_Line0)==SET)
	{
		if (GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_1) == 0)
		{
			Encoder_Count --;
		}
		EXTI_ClearITPendingBit(EXTI_Line0);
	}
}

int16_t Encoder_Get(void)
{
	int16_t temp;
	temp=Encoder_Count;
	Encoder_Count=0;
	return temp;
}

void EXTI1_IRQHandler(void)
{
	if (EXTI_GetITStatus(EXTI_Line1)==SET)
	{
		if (GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_0) == 0)
		{
			Encoder_Count++;
		}
		EXTI_ClearITPendingBit(EXTI_Line1);
	}
}
